# CLI Tools
brew "stow"

# Development
brew "mise"
brew "ruby-build"

# Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# Applications
cask "ghostty"
cask "raycast"
cask "visual-studio-code"
cask "cleanmymac"
cask "playcover-community"
cask "docker-desktop"
cask "ollama-app"
cask "dropbox"
cask "1password"
cask "chronosync"

# Fonts
cask "font-jetbrains-mono-nerd-font"
