# CLI Tools
brew "stow"
brew "bat"
brew "tmux"
brew "neovim"

# Development
brew "mise"
brew "ruby-build"
brew "ssh-copy-id"
# brew "mysql"
# brew "postgresql@18"
# brew "pgvector"
brew "ffmpeg"
brew "imagemagick"
brew "vips"
brew "redis"

# Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"
brew "starship"

# Applications
cask "ghostty"
cask "wezterm"
cask "raycast"
cask "visual-studio-code"
cask "cleanmymac"
cask "playcover-community"
cask "docker-desktop"
cask "ollama-app"
cask "dropbox"
cask "1password"
cask "chronosync"
cask "transmit"
cask "elmedia-player"
cask "movist-pro"
cask "cloudflare-warp"
cask "transmission"
cask "ollama-app"
cask "google-chrome"
cask "tableplus"
cask "screenflow"
cask "mweb-pro"
cask "readdle-spark"
cask "sourcetree"
cask "kitty"
cask "iterm2"

# Fonts
cask "font-jetbrains-mono-nerd-font"
