# CLI Tools
brew "stow"

# Development
brew "mise"
brew "ruby-build"
brew "ssh-copy-id"

# Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"
brew "starship"

# Applications
cask "ghostty"
cask "raycast"
cask "visual-studio-code"
cask "cleanmymac"
cask "playcover-community"
cask "docker-desktop"
cask "ollama-app"
cask "dropbox"
cask "1password"
cask "chronosync"
cask "transmit"
cask "elmedia-player"
cask "movist-pro"
cask "cloudflare-warp"
cask "transmission"
cask "ollama-app"
cask "google-chrome"
cask "tableplus"
cask "screenflow"

# Fonts
cask "font-jetbrains-mono-nerd-font"
